{
    "intents": [
        {
            "tag": "informacion_general",
            "patterns": [
                "¿Cuál es la direccion de la universidad?",
                "¿Cuáles son las fechas de inscripción?",
                "¿Cuál es el costo de la matrícula?",
                "¿Cuánto dura el programa de ingeniería?",
                "¿Cuáles son los requisitos de admisión?",
                "¿Hay programas de estudio en línea?",
                "¿Cuál es la tasa de empleo para los graduados de la universidad?",
                "¿Qué actividades extracurriculares ofrece la universidad?",
                "¿La universidad ofrece alojamiento para los estudiantes?"
            ],
            "responses": [
                "La dirección de la universidad es 123 Calle Principal, Ciudad, País.",
                "Las fechas de inscripción se pueden encontrar en el sitio web de la universidad.",
                "El costo de la matrícula varía según el programa de estudios. Se puede encontrar más información en el sitio web de la universidad.",
                "El programa de ingeniería dura cuatro años.",
                "Los requisitos de admisión varían según el programa de estudios. Se pueden encontrar más detalles en el sitio web de la universidad.",
                "Sí, la universidad ofrece varios programas de estudio en línea.",
                "La tasa de empleo para los graduados de la universidad es del 90%.",
                "La universidad ofrece una amplia variedad de actividades extracurriculares, incluyendo deportes, clubes estudiantiles y más. Se puede encontrar más información en el sitio web de la universidad.",
                "Sí, la universidad ofrece alojamiento en el campus para los estudiantes."
            ]
        },
        {
            "tag": "programas_estudio",
            "patterns": [
                "¿Qué programas de estudio ofrece la universidad?",
                "¿Cuál es el plan de estudios del programa de ciencias sociales?"
            ],
            "responses": [
                "La universidad ofrece una amplia variedad de programas de estudio, incluyendo ingeniería, ciencias sociales, negocios y más. Se puede encontrar más información en el sitio web de la universidad.",
                "El plan de estudios del programa de ciencias sociales incluye cursos en psicología, sociología, economía y más. Se puede encontrar más información en el sitio web de la universidad."
            ]
        },
        {
         "tag": "saludos",
         "patterns": [
             "hola",
             "buenos dias",
             "buenas tardes",
             "buenas noches"
         ],
         "responses": [
             "¡Hola! ¿En qué puedo ayudarte?",
             "¡Buenos dias! ¿En qué puedo ayudarte?",
             "¡Buenas tardes! ¿En qué puedo ayudarte?",
             "¡Buenas noches! ¿En qué puedo ayudarte?"
         ]
     }
    ]
 }
 